renesas/ra-fsp-examples/application_projects/r30an0392/Low_Power_Application_Use_of_ADC_DTC_and_ELC_at_Snooze_mode_for_FPB_RA2E1_and_FPB_RA2E2/LowPower_DataLogger_FPB_RA2E2/src/app_main.c
/***********************************************************************************************************************
 * File Name    : app_main.c
 * Description  : Contains data structures and functions used in app_main.c.
 **********************************************************************************************************************/

/**********************************************************************************************************************
* Copyright (c) 2022 - 2024 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*********************************************************************************************************************/

#include "hal_data.h"
#include "app_common.h"
#include "app_data_output.h"

volatile bool g_level_jedgement_result_flag;
volatile bool g_manual_lpm_cancel_flag;
volatile bool g_uart_transmit_complete_flag;
volatile bool g_timer_lpm_cancel_flag;

uint16_t g_raw_light_data_buff[RAW_DATA_BUFF_SIZE];
uint16_t g_raw_temp_data_buff[RAW_DATA_BUFF_SIZE];

// Prototype declaration
void app_main(void);

/*******************************************************************************************************************//**
 * @brief Main routine
 * @param None
 * @retval None
 **********************************************************************************************************************/
void app_main(void)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Initialize module */
    adc_initialize();
    lpm_initialize();
    icu_initialize();
    dtc_initialize();
    doc_initialize();
    elc_initialize();
    agt_initialize();

    /* Initialize PIN state */
    pin_state_change(LED, PIN_LOW__LED_OFF);
    pin_state_change(ERROR_LED, PIN_LOW__LED_OFF);

    /* Initialize flags */
    g_level_jedgement_result_flag = CLEAR_FLAG;
    g_manual_lpm_cancel_flag = CLEAR_FLAG;
    g_uart_transmit_complete_flag = CLEAR_FLAG;
    g_timer_lpm_cancel_flag = CLEAR_FLAG;

    /* Start AGT counting */
    agt_start();

    while(1){

        /* Check all flags clear */
        if(all_flags_clearing_check() == CLEAR_FLAG){

            /* Change the ADC scan start event to Snooze request */
            adc_scan_start_event_change(ELC_EVENT_LPM_SNOOZE_REQUEST);

            /* DEBUG LED LOW */
            pin_state_change(LED, PIN_LOW__LED_OFF);

            /* Enter the Low Power Mode */
            err = R_LPM_LowPowerModeEnter(&g_lpm_ctrl);
            if(err != FSP_SUCCESS)
            {
                pin_state_change(ERROR_LED, PIN_HIGH__LED_ON);
                __BKPT(0);
            }

            /* DEBUG LED HIGH */
            pin_state_change(LED, PIN_HIGH__LED_ON);

            /* Change the ADC scan start event to AGT1_underflow */
            adc_scan_start_event_change(ELC_EVENT_AGT1_INT);
        }

        /* Manual LPM Canceling function for DEBUG */
        if(g_manual_lpm_cancel_flag == SET_FLAG)
        {
            /* Clear the flag */
            g_manual_lpm_cancel_flag = CLEAR_FLAG;

            /* Data Output */
            data_output(SEND_AT_MANUAL_TIMING);

            /* Set Software break point if needed */
            //__BKPT(0);
        }

        /* Level Judgment Result Output function */
        if(g_level_jedgement_result_flag == SET_FLAG)
        {
            /* Clear the flag */
            g_level_jedgement_result_flag = CLEAR_FLAG;

            /* Data Output */
            data_output(SEND_LEVEL_JUDGEMENT_RESULT);
        }

        /* AGT0 Timer Output function (24 H periodic) */
        if(g_timer_lpm_cancel_flag == SET_FLAG)
        {
            /* Clear the flag */
            g_timer_lpm_cancel_flag = CLEAR_FLAG;

            /* Data Output */
            data_output(SEND_AT_24H_PERIOD);
        }

    }

}
